#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=bxl4]
random_id.airflow_webserver_secret: Refreshing state... [id=x26S6D9BwDs]
random_id.db_user_pass: Refreshing state... [id=i0AKWf6GgIU]
random_id.suffix: Refreshing state... [id=HALUyd94qio]
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/deb-sa@wizeline-deb.iam.gserviceaccount.com]
data.google_client_config.default: Reading...
module.cloudresourcemanager_service.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=wizeline-deb/cloudresourcemanager.googleapis.com]
data.google_service_account.deb-sa: Reading...
google_artifact_registry_repository.docker_repository: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/repositories/deb-capstone-airflow-gke]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/wizeline-deb/global/networks/deb-capstone-net]
data.google_client_config.default: Read complete after 0s [id=projects/"wizeline-deb"/regions/"us-central1"/zones/"us-central1-c"]
google_secret_manager_secret.airflow_webserver_secret: Refreshing state... [id=projects/wizeline-deb/secrets/airflow-webserver-secret]
data.google_service_account.deb-sa: Read complete after 0s [id=projects/wizeline-deb/serviceAccounts/deb-sa@wizeline-deb.iam.gserviceaccount.com]
google_secret_manager_secret_version.airflow_webserver_secret_v1: Refreshing state... [id=projects/734911192367/secrets/airflow-webserver-secret/versions/1]
data.google_secret_manager_secret_version.airflow_webserver_secret: Reading...
google_compute_global_address.private_ip_alloc: Refreshing state... [id=projects/wizeline-deb/global/addresses/private-ip-alloc]
module.gke.data.google_container_engine_versions.region: Reading...
module.gke.data.google_compute_zones.available: Reading...
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/wizeline-deb/serviceAccounts/tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-central1/deb-sub1"]: Refreshing state... [id=projects/wizeline-deb/regions/us-central1/subnetworks/deb-sub1]
module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=wizeline-deb/roles/logging.logWriter/serviceAccount:tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.airflow_webserver_secret: Read complete after 0s [id=projects/734911192367/secrets/airflow-webserver-secret/versions/1]
google_service_networking_connection.default: Refreshing state... [id=projects%2Fwizeline-deb%2Fglobal%2Fnetworks%2Fdeb-capstone-net:servicenetworking.googleapis.com]
module.gke.data.google_compute_zones.available: Read complete after 0s [id=projects/wizeline-deb/regions/us-central1]
module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke.data.google_container_engine_versions.zone: Reading...
module.gke.data.google_container_engine_versions.region: Read complete after 0s [id=2023-09-23 16:10:44.751885079 +0000 UTC]
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=wizeline-deb/roles/monitoring.metricWriter/serviceAccount:tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=wizeline-deb/roles/monitoring.viewer/serviceAccount:tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
module.gke.data.google_container_engine_versions.zone: Read complete after 0s [id=2023-09-23 16:10:44.968895284 +0000 UTC]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/clusters/deb-airflow-cluster-1c02d4c9df78aa2a]
null_resource.dependency_setter: Refreshing state... [id=7501409296193744120]
module.sql-db.null_resource.module_depends_on: Refreshing state... [id=7720046657180841183]
module.sql-db.google_sql_database_instance.default: Refreshing state... [id=deb-sql-instance-1c02d4c9df78aa2a]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=wizeline-deb/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-deb-airflow-clu-bxl4@wizeline-deb.iam.gserviceaccount.com]
module.sql-db.random_password.user-password: Refreshing state... [id=none]
module.sql-db.google_sql_database.additional_databases["deb-airflow-db"]: Refreshing state... [id=projects/wizeline-deb/instances/deb-sql-instance-1c02d4c9df78aa2a/databases/deb-airflow-db]
module.sql-db.google_sql_database.default[0]: Refreshing state... [id=projects/wizeline-deb/instances/deb-sql-instance-1c02d4c9df78aa2a/databases/default]
module.sql-db.google_sql_user.default[0]: Refreshing state... [id=default//deb-sql-instance-1c02d4c9df78aa2a]
module.gke.google_container_node_pool.pools["deb-node-pool"]: Refreshing state... [id=projects/wizeline-deb/locations/us-central1/clusters/deb-airflow-cluster-1c02d4c9df78aa2a/nodePools/deb-node-pool]
kubernetes_secret.airflow_ssh_secret: Refreshing state... [id=airflow/airflow-ssh-secret]
kubernetes_secret.airflow_webserver_secret: Refreshing state... [id=airflow/airflow-webserver-secret]
module.services.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=wizeline-deb/bigquery.googleapis.com]
module.services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=wizeline-deb/iam.googleapis.com]
module.services.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=wizeline-deb/secretmanager.googleapis.com]
module.services.google_project_service.project_services["storage-component.googleapis.com"]: Refreshing state... [id=wizeline-deb/storage-component.googleapis.com]
module.services.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=wizeline-deb/artifactregistry.googleapis.com]
module.services.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=wizeline-deb/iamcredentials.googleapis.com]
module.services.google_project_service.project_services["sqladmin.googleapis.com"]: Refreshing state... [id=wizeline-deb/sqladmin.googleapis.com]
module.services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=wizeline-deb/compute.googleapis.com]
module.services.google_project_service.project_services["container.googleapis.com"]: Refreshing state... [id=wizeline-deb/container.googleapis.com]
module.services.google_project_service.project_services["dataproc.googleapis.com"]: Refreshing state... [id=wizeline-deb/dataproc.googleapis.com]
google_secret_manager_secret.db_user_pass: Refreshing state... [id=projects/wizeline-deb/secrets/db-user-pass-1c02d4c9df78aa2a]
module.services.google_project_service.project_services["cloudbuild.googleapis.com"]: Refreshing state... [id=wizeline-deb/cloudbuild.googleapis.com]
module.services.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=wizeline-deb/servicenetworking.googleapis.com]
google_secret_manager_secret_version.db_user_pass: Refreshing state... [id=projects/734911192367/secrets/db-user-pass-1c02d4c9df78aa2a/versions/1]
data.google_secret_manager_secret_version.db_user_pass: Reading...
data.google_secret_manager_secret_version.db_user_pass: Read complete after 0s [id=projects/734911192367/secrets/db-user-pass-1c02d4c9df78aa2a/versions/1]
module.sql-db.random_password.additional_passwords["postgres0"]: Refreshing state... [id=none]
module.sql-db.google_sql_user.additional_users["postgres0"]: Refreshing state... [id=postgres0//deb-sql-instance-1c02d4c9df78aa2a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.airflow will be created
  + resource "helm_release" "airflow" {
      + atomic                     = false
      + chart                      = "airflow"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "airflow"
      + namespace                  = "airflow"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://airflow.apache.org"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # Airflow home directory
                # Used for mount paths
                airflowHome: /opt/airflow
                
                # Default airflow repository -- overridden by all the specific images below
                defaultAirflowRepository: apache/airflow
                
                # Default airflow tag to deploy
                defaultAirflowTag: "2.7.1"
                
                # Airflow version (Used to make some decisions based on Airflow Version being deployed)
                airflowVersion: "2.7.1"
                
                # Images
                images:
                  airflow:
                    repository: ~
                    tag: ~
                    # Specifying digest takes precedence over tag.
                    digest: ~
                    pullPolicy: IfNotPresent
                
                executor: KubernetesExecutor
                
                data:
                  metadataConnection:
                    user: postgres0
                    pass: REPLACE_WITH_DB_PASSWORD
                    protocol: postgresql
                    host: REPLACE_WITH_DB_HOST
                    port: 5432
                    db: deb-airflow-db
                    sslmode: disable
                
                # Git sync
                dags:
                  gitSync:
                    enabled: true
                    repo: git@github.com:uche-madu/deb-application.git
                    branch: main
                    subPath: "dags"
                    sshKeySecret: airflow-ssh-secret
                
                    # Get info about known_hosts from here: https://airflow.apache.org/docs/helm-chart/stable/production-guide.html#knownhosts
                    knownHosts: |
                      github.com ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCj7ndNxQowgcQnjshcLrqPEiiphnt+VTTvDP6mHBL9j1aNUkY4Ue1gvwnGLVlOhGeYrnZaMgRK6+PKCUXaDbC7qtbW8gIkhL7aGCsOr/C56SJMy/BCZfxd1nWzAOxSDPgVsmerOBYfNqltV9/hWCqBywINIR+5dIg6JTJ72pcEpEjcYgXkE2YEFXV1JHnsKgbLWNlhScqb2UmyRkQyytRLtL+38TGxkxCflmO+5Z8CSSNY7GidjMIZ7Q4zMjA2n1nGrlTDkzwDCsw+wqFPGQA179cnfGWOWRVruj16z6XyvxvjJwbz0wQZ75XK5tKSb7FNyeIEs4TT4jk+S4dhPeAUC5y+bDYirYgM4GC7uEnztnZyaVWQ7B381AK4Qdrwt51ZqExKbQpTUNn+EjqoTwvqNj4kqx5QUCI0ThS/YkOxJCXmPUWZbhjpCg56i+2aB6CmK2JGhn57K5mj0MNdBXA4/WnwH6XoPWJzK5Nyu2zB3nAZp+S5hpQs+p1vN1/wsjk=
                  
                # extraSecrets:
                #   airflow-ssh-secret:
                #     data:
                #       gitSshKey: ~
                
                
                # Flask secret key for Airflow Webserver: `[webserver] secret_key` in airflow.cfg
                # webserverSecretKey: ~
                webserverSecretKeySecretName: "airflow-webserver-secret"
                
                
                # Airflow webserver settings
                webserver:
                  service:
                    type: LoadBalancer
                  
                  # Create initial user.
                  defaultUser:
                    enabled: true
                    role: Admin
                    username: admin
                    email: admin@example.com
                    firstName: admin
                    lastName: user
                    password: admin
                
                postgresql:
                  enabled: false
                
                workers:
                  persistence:
                    size: 10Gi
                    
                # Airflow Triggerer Config
                triggerer:
                  persistence:
                    # Volume size for triggerer StatefulSet
                    size: 5Gi
            EOT,
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "1.10.0"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # module.gke.google_container_node_pool.pools["deb-node-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                          = "projects/wizeline-deb/locations/us-central1/clusters/deb-airflow-cluster-1c02d4c9df78aa2a/nodePools/deb-node-pool" -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/wizeline-deb/zones/us-central1-c/instanceGroupManagers/gke-deb-airflow-cluster-deb-node-pool-82b24dc1-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/wizeline-deb/zones/us-central1-c/instanceGroups/gke-deb-airflow-cluster-deb-node-pool-82b24dc1-grp",
        ] -> (known after apply)
      ~ max_pods_per_node           = 110 -> (known after apply)
        name                        = "deb-node-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 1 -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.27.3-gke.100" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "BALANCED" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
          - pod_ipv4_cidr_block  = "10.10.11.0/24" -> null
          - pod_range            = "deb-sub1-secondary-gke-pods" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 30 -> 31 # forces replacement
          ~ guest_accelerator = [] -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
            tags              = [
                "gke-deb-airflow-cluster-1c02d4c9df78aa2a",
                "gke-deb-airflow-cluster-1c02d4c9df78aa2a-deb-node-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (11 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      ~ upgrade_settings {
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ gke_cluster_name          = "deb-airflow-cluster-1c02d4c9df78aa2a" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @uche-madu, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*